{
  "backend/main.mo": "Main Motoko canister defining the social app backend with access control, blob storage, payments, and extensive types and APIs for users, profiles, messaging (DMs and groups), feeds, points, premium features, media, and creator content.",
  "feature_evidence.json": "Machine-readable report documenting implemented frontend features for direct messaging and chat list updates, including affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files describing the purpose and behavior of pages, components, hooks, and styles across the React application.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, color variables, layout primitives, and base styles for the application.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application via the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component handling authentication, loading and profile setup flows, periodic last-online updates, and routing between login, setup, and the main app shell.",
  "frontend/src/components/ChatList.tsx": "Sidebar component that lists direct message conversation partners, fetching user profiles and last-online status and allowing selection of an active chat.",
  "frontend/src/components/ChatWindow.tsx": "Direct messaging UI that displays a conversation with a selected user, polls and refetches messages, sends new messages, updates online status, and manages scrolling and timestamps.",
  "frontend/src/components/EditProfileDialog.tsx": "Modal dialog that lets a user edit and submit profile bio changes, calling an update profile mutation and showing loading and toast feedback.",
  "frontend/src/components/FeedItem.tsx": "Displays a single feed item card with user avatar, username, relative timestamp, and optional status text, fetching the author’s profile for the avatar.",
  "frontend/src/components/FriendSuggestionCard.tsx": "Card component for suggested users showing avatar, follower count, bio preview, and a follow button with async follow handling and toasts.",
  "frontend/src/components/groups/AddGroupMembersDialog.tsx": "Dialog for searching users and adding them to a group, filtering existing members and handling add-member mutations with detailed error feedback.",
  "frontend/src/components/groups/CreateGroupDialog.tsx": "Modal dialog component for creating a new group with name and optional description, including client-side validation, loading state, and error display.",
  "frontend/src/components/groups/GroupConversation.tsx": "Main group chat UI that fetches and displays group messages, auto-refreshes and scrolls, allows sending text/media messages, and opens a dialog to add members.",
  "frontend/src/components/Header.tsx": "Application header with branding, points badge, theme toggle, and user avatar menu that shows profile info and supports logout.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen animated loading screen with flame visuals, beat animation, and branded loading message.",
  "frontend/src/components/ProfileSetupModal.tsx": "Blocking modal shown on first use to create a user profile by entering username and optional bio, with validation and async create mutation.",
  "frontend/src/components/UserCard.tsx": "Reusable user card showing avatar, follower/following counts, bio preview, and follow or unfollow actions based on current relationship.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, handling authenticated vs anonymous access and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, persisted identities, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, presence, groups, messages, and other app data with caching and mutations.",
  "frontend/src/hooks/useVoiceSettings.ts": "Hook that manages AI voice settings (enabled, volume, muted) persisted in localStorage and synchronized across tabs and same-tab updates.",
  "frontend/src/hooks/useWebSearchUltra.ts": "Hook providing a mock web search API with loading and error state, simulating asynchronous search results for future real web integration.",
  "frontend/src/index.css": "Initializes Tailwind CSS layers and defines extensive CSS variables for base theming, dark mode, charts, and many feature-specific color themes (music, AI, rewards, etc.).",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers, importing global styles.",
  "frontend/src/pages/AISongGeneratorPage.tsx": "Implements a UI for generating AI songs by genre with simulated async generation, showing results, loading states, and toast notifications.",
  "frontend/src/pages/ChatsPage.tsx": "Provides a responsive chat interface with a searchable chat list, direct message partners, and a chat window that adapts for desktop and mobile.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Renders a creator dashboard with themed header and tabbed sections (overview, music, videos, movies, radio) displaying placeholder content stats.",
  "frontend/src/pages/DailyItemsSecretPage.tsx": "Handles claiming a daily mystery item using identity-based queries, with animations, item-type handling, availability checks, and detailed toast feedback.",
  "frontend/src/pages/DailyRewardsPage.tsx": "Implements daily reward claiming logic with streak tracking, eligibility checks, animated feedback, and display of user reward statistics.",
  "frontend/src/pages/FeedPage.tsx": "Renders the main home feed with sections for recent status updates, the user's feed items, and friend suggestions using query hooks. Handles loading states with skeletons and displays empty-state messaging when no data is available.",
  "frontend/src/pages/GamesComingSoonPage.tsx": "Displays a marketing-style page for upcoming games, including a hero section, feature highlights, and a list of upcoming games fetched from an API. Shows a loading spinner while fetching data.",
  "frontend/src/pages/GroupsPage.tsx": "Provides group management and group chat access, allowing authenticated users to view, select, and create groups. Shows a sign-in prompt for unauthenticated users and integrates dialogs, toasts, and group conversations.",
  "frontend/src/pages/HelpPage.tsx": "Implements a help and FAQ page with categorized help sections and expandable accordion-based questions and answers. Serves as user documentation for platform features like points, apps, and premium membership.",
  "frontend/src/pages/LiveStreamsPage.tsx": "Lists live and scheduled streams, allows users to start new streams, and lets stream owners stop their streams. Integrates live stream queries, creation dialogs, and identity-based ownership checks.",
  "frontend/src/pages/LiveTVPage.tsx": "Implements a simulated Live TV page with a list of predefined channels, category badges, and a mock video player that supports channel selection and play/pause state.",
  "frontend/src/pages/LoginPage.tsx": "Renders the public login and marketing page for JAMESPaudio, showcasing platform features and triggering Internet Identity login.",
  "frontend/src/pages/MainApp.tsx": "Acts as the main application shell, managing page navigation state and rendering the active feature page with a shared header and navigation UI.",
  "frontend/src/pages/MembersOnlyPage.tsx": "Provides a premium members-only area that checks user subscription status, handles free trials and upgrades, and conditionally displays exclusive content.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a movies landing page with a header and a grid of sample movies, each offering basic metadata and a mock watch action.",
  "frontend/src/pages/MusicPage.tsx": "Implements a music library where users can upload tracks, browse friends’ music, and play or pause audio using backend upload and query hooks.",
  "frontend/src/pages/PageUnavailablePage.tsx": "Renders a full-page 404/Page Unavailable error view with explanatory text, an illustration, and actions to reload or return home. Used as a fallback when a page or resource is inaccessible.",
  "frontend/src/pages/PhoneProtectionPage.tsx": "Implements a Phone Protection dashboard with a simulated security scan flow, showing scanning state, completion status, and basic security tips. Uses local state to animate and toggle scan results.",
  "frontend/src/pages/PointsPage.tsx": "Displays the user's points wallet, including current balance, navigation to the points store and rewards, and a sorted transaction history. Fetches profile and points history data and formats transactions with icons and colors.",
  "frontend/src/pages/PointsStorePage.tsx": "Provides a points store where users can buy points with preset or custom amounts and redeem store items. Handles purchases, balance checks, error/success toasts, and navigation back to the wallet.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile with avatar, bio, followers/following stats, points, rewards, and activity info. Supports editing the profile and formats last-online status from backend timestamps.",
  "frontend/src/pages/PublishedAppsPage.tsx": "Lists community-published apps and allows eligible users (with sufficient points) to publish a new app via a dialog form. Fetches published apps, validates input, and submits publish actions with feedback toasts.",
  "frontend/src/pages/RadioPage.tsx": "Renders a radio stations page with a static list of stations and UI to toggle play/stop state per station. Uses local React state to track the currently playing station and shows simple animated feedback.",
  "frontend/src/pages/RobuxSimulatorPage.tsx": "Implements a playful Robux code generator that creates fake codes based on user input. Includes form validation, clipboard copying, and toast notifications, explicitly marked as not real.",
  "frontend/src/pages/SearchEnginePage.tsx": "A full-featured search engine interface supporting multiple tabs, web search, math evaluation, voice input, and voice output. Integrates many hooks for search, history, identity, voice settings, and speech recognition/synthesis.",
  "frontend/src/pages/SearchEngineStorePage.tsx": "Displays a store-like interface to browse available search engines, view history, and set a default provider. Requires authentication to modify defaults and uses backend queries with loading and error states.",
  "frontend/src/pages/SearchPage.tsx": "Provides a simple user search page that queries profiles by username and displays results in a grid. Handles loading, empty, and initial states with basic UI feedback.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for audio preferences including background music and AI voice controls. Persists settings in localStorage, notifies voice listeners of changes, and provides sliders and toggles with toast feedback.",
  "frontend/src/pages/VideosPage.tsx": "Implements a videos page with a header, list of uploaded videos, and a dialog-based upload form using local state and mock uploads with toasts.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page that introduces the platform’s features and branding, with login actions via Internet Identity and a marketing-style layout.",
  "frontend/src/pages/WhatsNewPage.tsx": "Displays a static announcements and updates page, rendering a preformatted changelog-style text inside a scrollable card layout.",
  "frontend/src/pages/WhatsNextPage.tsx": "Roadmap page that fetches upcoming features, shows their status with icons and badges, and presents them in a scrollable, card-based UI.",
  "frontend/src/types/temporary.ts": "Defines temporary frontend TypeScript types and enums (e.g., users, messages, streams, upcoming features) used before backend implementation is finalized.",
  "frontend/src/utils/safeMathEvaluator.ts": "Provides a safe arithmetic expression evaluator without eval, using tokenization and a recursive descent parser to handle basic math operations and parentheses.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL taking precedence. Includes logic to safely store, retrieve, and remove sensitive parameters without reloading the page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode behavior, content scanning paths, container defaults, and extensive theme extensions for colors, radii, shadows, animations, and keyframes. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current architecture and implemented features, including schema/versioning metadata and a high-level summary of the app. Enumerates existing backend and frontend features (e.g., auth, RBAC, profiles, points, groups) with IDs, descriptions, and versions."
}