{
  "backend/main.mo": "Main Motoko canister defining core backend logic, data models, and services for users, social features, messaging, points, premium content, storage, access control, and integrations (Stripe, HTTP outcalls, blob storage). It initializes authorization and storage mixins and declares extensive domain types for the app.",
  "feature_evidence.json": "Machine-readable feature evidence report describing a planned frontend update to add a \"Web Search Ultra\" coming-soon feature, including affected files, dependencies, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend React files, outlining pages, components, hooks, and styles across the application for documentation or planning purposes.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color themes (light/dark), layout variables, and shared base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point for the frontend application that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component handling authentication state, loading screen, profile setup flow, and periodic last-online updates before rendering the main app or login page.",
  "frontend/src/components/ChatList.tsx": "Sidebar component that lists chat contacts with avatars, usernames, and last-online status, allowing selection of a user to start or continue a conversation.",
  "frontend/src/components/ChatWindow.tsx": "Real-time chat interface displaying messages with a selected user, supporting polling, auto-scroll, message sending, and periodic last-online updates.",
  "frontend/src/components/EditProfileDialog.tsx": "Modal dialog that allows users to edit and save profile information such as bio and status, with form state handling and mutation feedback.",
  "frontend/src/components/FeedItem.tsx": "Renders a single feed item card showing the user avatar, username, relative timestamp, and optional status text. Fetches the poster’s profile and formats timestamps from bigint nanoseconds.",
  "frontend/src/components/FriendSuggestionCard.tsx": "Displays a suggested user card with avatar, follower count, bio, and a Follow button. Uses a follow mutation with loading state and toast notifications.",
  "frontend/src/components/Header.tsx": "Top navigation header showing branding, theme toggle, user points, and a user avatar dropdown. Integrates Internet Identity logout, profile data, and navigation.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen animated loading screen with flame-themed visuals, beat animation, and particle effects. Used as a branded loading state overlay.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new users to create a profile by entering a username and optional bio. Submits via a create-profile mutation with validation and toasts.",
  "frontend/src/components/UserCard.tsx": "User profile card showing avatar, follower/following counts, bio, and follow/unfollow actions. Determines follow state from the caller’s profile and handles mutations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity. Reinitializes the actor on identity change and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, managing login, logout, identity persistence, and status flags. Wraps AuthClient setup and exposes hooks for app-wide access.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of React Query hooks for interacting with the backend actor, covering user profiles, last-online status, feeds, search, points, uploads, premium content, live streams, mystery items, and other app data.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base styles and an extensive set of CSS variables for light/dark modes and many themed color palettes used across the app.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up the React Query client, wraps the app with Internet Identity and query providers, and renders the root component.",
  "frontend/src/pages/AISongGeneratorPage.tsx": "UI page that simulates AI music generation by genre, allowing users to generate, view, and interact with mock AI-generated songs using local state.",
  "frontend/src/pages/ChatsPage.tsx": "Implements the chat interface with a searchable sidebar of chat users and a responsive chat window, using the current user's profile to determine available chats.",
  "frontend/src/pages/CreatorStudioPage.tsx": "Creator dashboard page with themed header and tabbed sections showing overview statistics and placeholders for managing music, videos, movies, and radio content.",
  "frontend/src/pages/DailyItemsSecretPage.tsx": "Feature page that lets authenticated users claim a daily mystery reward, showing availability, animations, reward details, and last-claimed information via backend queries.",
  "frontend/src/pages/DailyRewardsPage.tsx": "Implements the Daily Rewards page where users can view their streak, points, and claim a once-per-day reward via API hooks, with animations and toast feedback.",
  "frontend/src/pages/FeedPage.tsx": "Renders the home feed combining recent status updates, the main user feed, and friend suggestions, handling loading and empty states.",
  "frontend/src/pages/GamesComingSoonPage.tsx": "Displays a marketing-style \"Games Coming Soon\" page with a hero section, feature highlights, and a list of upcoming games fetched from an API.",
  "frontend/src/pages/GroupsPage.tsx": "Shows a placeholder Groups page with a styled header and a coming-soon card outlining planned group and community features.",
  "frontend/src/pages/HelpPage.tsx": "Provides a help and FAQ page with categorized sections, accordions for common questions, and guidance on platform features like points, rewards, and publishing.",
  "frontend/src/pages/LiveStreamsPage.tsx": "Implements a live streaming page that lists live and scheduled streams, allows authenticated users to create or stop streams, and manages stream creation via dialogs and API hooks.",
  "frontend/src/pages/LiveTVPage.tsx": "Implements a simulated Live TV page with a list of predefined channels, category badges, and a mock video player with play/pause state. Manages selected channel and playback UI using React state and shared UI components.",
  "frontend/src/pages/LoginPage.tsx": "Renders a branded login/landing page highlighting platform features and triggers authentication via Internet Identity. Displays marketing content, feature grid, and a login button with loading state.",
  "frontend/src/pages/MainApp.tsx": "Acts as the main application shell managing navigation and routing between many feature pages. Defines navigation items, page types, layout components, and integrates TanStack Router.",
  "frontend/src/pages/MembersOnlyPage.tsx": "Handles the premium members-only area with free trial logic, upgrade flows, and gated content. Fetches user profile and premium data, showing alerts and actions based on membership status.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a simple movies browsing page with a hero header and a grid of sample movies. Each movie card shows metadata and a non-functional \"Watch Now\" button.",
  "frontend/src/pages/MusicPage.tsx": "Provides a music library where users can upload tracks, view friends’ music, and play/pause tracks. Integrates backend queries for profiles and uploads, handles file upload progress, and manages playback state.",
  "frontend/src/pages/PageUnavailablePage.tsx": "Renders a styled 404/Page Unavailable error page with explanations, error imagery, and actions to reload or return home via full page reload.",
  "frontend/src/pages/PhoneProtectionPage.tsx": "Displays a phone security dashboard with a simulated security scan, showing scanning progress and a secure result along with basic security tips.",
  "frontend/src/pages/PointsPage.tsx": "Shows the user's points wallet with current balance, navigation to store and rewards, and a sorted transaction history fetched from backend queries.",
  "frontend/src/pages/PointsStorePage.tsx": "Implements a points store where users can buy points, redeem store items, and view available rewards with purchase validation and toast feedback.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and manages the user's profile, including avatar, bio, followers, points, activity stats, last online status, and an edit profile dialog.",
  "frontend/src/pages/PublishedAppsPage.tsx": "Lists community-published apps and allows eligible users to publish a new app through a dialog form, gated by minimum point balance.",
  "frontend/src/pages/RadioPage.tsx": "Renders a radio stations page with a static list of stations, allowing users to toggle play/stop state per station with simple UI feedback. Uses local state only and does not stream real audio.",
  "frontend/src/pages/RobuxSimulatorPage.tsx": "Implements a playful Robux code generator that creates fake codes based on user input, with validation, copy-to-clipboard support, and warning messaging that it is not real.",
  "frontend/src/pages/SearchEnginePage.tsx": "A full-featured search interface supporting multiple content tabs, math evaluation, voice input via speech recognition, and spoken results via speech synthesis, backed by custom search hooks.",
  "frontend/src/pages/SearchPage.tsx": "Provides a simple user search page that queries profiles by username and displays results using reusable UserCard components with loading and empty states.",
  "frontend/src/pages/SettingsPage.tsx": "Displays application settings for background music, volume, and AI voice responses, persisting preferences in localStorage and providing immediate feedback via toggles and sliders.",
  "frontend/src/pages/VideosPage.tsx": "Allows users to upload and locally preview video entries with titles and descriptions, managing video state client-side without backend persistence.",
  "frontend/src/pages/WelcomePage.tsx": "Landing page component that presents the JAMESPaudio platform with marketing copy, feature highlights, and hero imagery. Integrates Internet Identity login and provides primary entry points via Login/Get Started buttons.",
  "frontend/src/pages/WhatsNewPage.tsx": "Static announcements page displaying recent features, updates, and achievements in a scrollable card layout. Uses predefined text content and UI components to present platform news.",
  "frontend/src/pages/WhatsNextPage.tsx": "Roadmap page that fetches and displays upcoming features with status indicators (planned, in progress, testing, released). Includes loading state, status icons/badges, and a visual roadmap image.",
  "frontend/src/types/temporary.ts": "Temporary TypeScript type definitions and enums for frontend features awaiting backend support, including users, messages, media, live streams, and upcoming features. Intended to be removed once backend APIs are finalized.",
  "frontend/src/utils/safeMathEvaluator.ts": "Implements a safe arithmetic expression evaluator without using eval, supporting basic operators, parentheses, and unary operations. Uses tokenization and recursive descent parsing with error handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters across query strings, hash-based routing, and sessionStorage. Designed to safely manage navigation state and sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container defaults, and extensive theme extensions for colors (CSS variable–driven), border radius, shadows, and accordion animations. Includes typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata and evolving product summary for the JAMESPaudio Social App, including schema/versioning and a high-level roadmap. Enumerates existing features with IDs, descriptions, and versions covering authentication, access control, profiles, search, presence, and points."
}