{
  "kind": "build_request",
  "title": "Implement direct instant messaging (1:1 DMs) end-to-end",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend-supported 1:1 direct messaging so authenticated users can send a message to another user and retrieve the full conversation history with that user. Add Motoko canister methods for (a) sending a direct message and (b) querying direct messages between the caller and a specified other user, returning messages in chronological order and enforcing that only the two participants can access the conversation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add instant messages"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared method to send a direct message from the caller to a receiver Principal with non-empty content.",
        "Backend exposes a query method to fetch the conversation between the caller and a specified other Principal; it returns only messages where (sender==caller AND receiver==other) OR (sender==other AND receiver==caller).",
        "Returned messages are sorted oldest-to-newest (ascending by timestamp, stable for equal timestamps).",
        "Unauthorized access is rejected (e.g., a caller cannot fetch a conversation they are not a participant in)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a backend API to support an ‘inbox’/chat list for direct messages: provide a method that returns the list of unique conversation partners for the caller (Principals) ordered by most recent message activity, so the frontend Chats page can show real DM threads even if follow/unfollow is not implemented.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add instant messages"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns unique DM partner Principals for the caller.",
        "The list is ordered by latest message timestamp descending across each partner thread.",
        "Partners include users who have either sent a message to the caller or received a message from the caller."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire up direct messaging in the React frontend by implementing `useGetMessagesWithUser` and `useSendMessage` in `frontend/src/hooks/useQueries.ts` to call the new backend DM APIs, and update the chat UI so sending a message immediately adds it to the conversation view (optimistic update or immediate refetch) and polling/refetching shows new messages without a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add instant messages"
        ]
      },
      "acceptanceCriteria": [
        "`useSendMessage` no longer throws 'Messaging functionality not yet implemented' and successfully sends messages via the canister.",
        "`useGetMessagesWithUser` no longer returns an empty array stub and displays real conversation history.",
        "After sending a message in `ChatWindow`, the message appears in the UI within 1 second without manual refresh.",
        "Polling/refetch in `ChatWindow` results in newly received messages appearing automatically."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the Chats page sidebar data source to use the backend ‘inbox’/chat list for direct messages (most recent DM partners) instead of relying only on followers/following lists, while keeping the existing search filter UI working.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add instant messages"
        ]
      },
      "acceptanceCriteria": [
        "Chats sidebar shows users you have direct-messaged with, even if followers/following are empty.",
        "Search filtering still narrows the displayed chat list based on the existing search input.",
        "Selecting a user from the chat list opens the correct 1:1 conversation in `ChatWindow`."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic must live in backend/main.mo; add backend APIs there.",
    "Do not edit any frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose existing hooks/components instead).",
    "Do not implement WebSockets or any real-time socket layer; use polling/refetch patterns already used by the chat components."
  ],
  "nonGoals": [
    "Group messaging changes (group chat already exists); this request is specifically for 1:1 direct messages.",
    "Follow/unfollow implementation (currently stubbed) unless required for DM functionality.",
    "Read receipts, typing indicators, message reactions, or push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}