{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Direct messaging (1:1 DMs) frontend wiring: hooks + chats sidebar",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Implement DM query/mutation hooks and update the chat window to show real 1:1 conversation history with fast send + polling-based updates.",
      "acceptanceCriteria": [
        "`useSendMessage` no longer throws 'Messaging functionality not yet implemented' and successfully sends messages via the canister.",
        "`useGetMessagesWithUser` no longer returns an empty array stub and displays real conversation history.",
        "After sending a message in `ChatWindow`, the message appears in the UI within 1 second without manual refresh.",
        "Polling/refetch in `ChatWindow` results in newly received messages appearing automatically."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement `useGetMessagesWithUser` to fetch real DM history via the backend DM capability (use `actor.getDirectMessages(otherUser)`), returning chronological messages. Implement `useSendMessage` to send via the backend DM capability (use `actor.sendDirectMessage(receiver, content)`), with an optimistic update (or immediate refetch) so the newly sent message appears in the conversation UI within 1 second. Ensure hooks are only enabled when the user is authenticated (authorization component guidance); handle unauthorized traps gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ChatWindow.tsx",
          "operation": "modify",
          "description": "Update `ChatWindow` to consume the real DM message type returned by `useGetMessagesWithUser` and ensure the post-send behavior results in the message appearing in the UI within 1 second (rely on optimistic cache update and/or immediate refetch after mutation success). Keep the existing polling/refetch pattern (no WebSockets)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the Chats sidebar to use the backend DM inbox/chat-partners list while preserving the current search filtering and conversation selection behavior.",
      "acceptanceCriteria": [
        "Chats sidebar shows users you have direct-messaged with, even if followers/following are empty.",
        "Search filtering still narrows the displayed chat list based on the existing search input.",
        "Selecting a user from the chat list opens the correct 1:1 conversation in `ChatWindow`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a react-query hook (e.g., `useGetDirectMessagePartners`) that loads the caller’s DM chat list via the backend inbox capability (use `actor.getDirectMessagePartners()`), with authentication-aware `enabled` gating per authorization component guidance and basic unauthorized-error handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ChatsPage.tsx",
          "operation": "modify",
          "description": "Replace the sidebar data source derived from followers/following with the DM partners list from the new hook. Keep the existing search input and filtering behavior, and continue wiring selection to `ChatList` and `ChatWindow` so clicking a partner opens the correct 1:1 conversation."
        },
        {
          "path": "frontend/src/components/ChatList.tsx",
          "operation": "modify",
          "description": "Update the empty-state copy to reflect DM-based chat threads (not follower-based), and ensure it still renders partner principals provided by the updated Chats page."
        }
      ]
    }
  ]
}