{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 14,
  "summary": "JAMESPaudio is evolving into a fuller “JAMESPaudio Social App” creative social hub on the Internet Computer: authenticated social/chat + profiles, points/rewards economy (including store/publishing unlock), groups (user-create/join), richer help/FAQ, expanded search (including improved math/voice features and placeholders like Web Search Ultra), and additional content modules (e.g., Live TV) alongside existing simulated/demo modules.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication & session management",
      "synonyms": [
        "II login",
        "AuthClient login"
      ],
      "description": "Users authenticate via Internet Identity (InternetIdentityProvider). The provider loads an existing session on mount, supports login/logout, and exposes status flags (initializing/logging-in/success/error) to gate the app UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Canister actor creation and access-control initialization",
      "synonyms": [
        "useActor",
        "actor bootstrap"
      ],
      "description": "The frontend builds a canister actor with identity-aware agent options. On actor creation it calls _initializeAccessControlWithSecret using a secret token from the URL hash (caffeineAdminToken) to register the principal and potentially assign the first admin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based authorization (admin/user/guest) in backend",
      "synonyms": [
        "AccessControl",
        "RBAC"
      ],
      "description": "Motoko access-control module assigns roles per principal (first valid secret becomes admin; otherwise user; anonymous is guest) and enforces role checks across backend endpoints (e.g., admin-only configuration and item management).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Profile onboarding (first-time profile creation)",
      "synonyms": [
        "Profile setup modal",
        "createProfile"
      ],
      "description": "Authenticated users without a profile are prompted with ProfileSetupModal to create a profile (username required, bio optional) via backend createProfile, then proceed into the main app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile viewing and editing (bio, picture)",
      "synonyms": [
        "Profile page",
        "updateProfile"
      ],
      "description": "ProfilePage displays username, bio, followers/following counts, points, badges, streak/rewards stats, and last-online status. EditProfileDialog updates the bio (and retains the existing profile picture) via backend updateProfile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User search by username",
      "synonyms": [
        "Search users",
        "searchProfiles"
      ],
      "description": "SearchPage lets users search for other users by username. Results render as UserCards showing avatar, follower/following counts, and bio. Search is backed by backend searchProfiles through a React Query hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Last online tracking and presence display",
      "synonyms": [
        "Presence",
        "updateLastOnline"
      ],
      "description": "Backend tracks a lastOnline timestamp per profile. Frontend periodically updates last online (App and ChatWindow), and displays “Active now” / relative timestamps in ProfilePage and ChatList items.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Points system with wallet and transaction history",
      "synonyms": [
        "Points wallet",
        "points history"
      ],
      "description": "Backend maintains a points balance on the user profile and stores points transactions. PointsPage shows current balance, derived stats (earned/spent/transaction count), and a scrollable transaction list with type-based icons and formatting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Daily rewards claiming with streak tracking",
      "synonyms": [
        "claimDailyReward",
        "daily login streak"
      ],
      "description": "DailyRewardsPage calls backend claimDailyReward to award points once per day and updates streak/rewardsClaimed fields. UI includes an animated reward chest and streak bonus info.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Points store (browse items, redeem items, demo buy-points)",
      "synonyms": [
        "PointsStore",
        "purchaseStoreItem",
        "purchasePoints"
      ],
      "description": "PointsStorePage displays store items fetched from backend getStoreItems and allows redeeming items via purchaseStoreItem (spends points). It also includes a demo flow to “buy points” by calling backend purchasePoints (Stripe payment noted as coming soon).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Daily Items Secret (mystery box) rewards",
      "synonyms": [
        "Daily mystery box",
        "claimDailyItemsSecret"
      ],
      "description": "DailyItemsSecretPage offers a once-per-day mystery claim with animations. Backend supports mystery items (admin CRUD) and a claim endpoint that can award points and returns the claimed MysteryItem; frontend displays the revealed item and last claimed item.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Music uploads with IC blob storage and friends discovery",
      "synonyms": [
        "Music library",
        "uploadMusic",
        "friends music"
      ],
      "description": "MusicPage uploads audio using ExternalBlob, showing upload progress, and stores uploads in the user profile via backend uploadMusic. A Friends’ Music section fetches music uploads from followed users via getFriendsMusicUploads and supports playback using the blob’s direct URL.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Premium membership and free trial flows",
      "synonyms": [
        "Members-only",
        "upgradeToPremium",
        "activateFreeTrial"
      ],
      "description": "Backend supports premium membership expiration and a one-time free trial window. MembersOnlyPage allows activating a 3-day trial and upgrading membership for a selected duration; it gates premium content display based on premium/trial status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Advanced Search Engine: voice input + math solver + AI voice responses",
      "synonyms": [
        "Voice search",
        "Math search",
        "Speech synthesis"
      ],
      "description": "SearchEnginePage supports browser speech recognition (voice-to-text), a client-side advanced math solver with step-by-step output, and spoken answers using speechSynthesis (respecting a persisted setting toggle). Other content search tabs are present but currently “coming soon.”",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Settings persistence for audio and AI voice assistant",
      "synonyms": [
        "Local settings",
        "localStorage settings"
      ],
      "description": "SettingsPage stores and restores user preferences in localStorage (background music enabled, volume slider, AI voice responses enabled/disabled), with toast feedback on toggles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Responsive app shell navigation, header utilities, and theming",
      "synonyms": [
        "Sidebar navigation",
        "theme toggle",
        "header points badge"
      ],
      "description": "MainApp provides a desktop sidebar and mobile sheet menu to switch between modules. Header shows branding, a points badge linking to points pages, a light/dark theme toggle, and a user avatar menu with logout that clears React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Loading and onboarding UI experiences",
      "synonyms": [
        "LoadingScreen",
        "launch animation"
      ],
      "description": "App shows a fire-themed animated LoadingScreen on startup, then gates UI based on auth/profile loading states and drives the profile setup flow for first-time users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Content hub modules with simulated/demo implementations",
      "synonyms": [
        "Live TV demo",
        "Radio demo",
        "AI song generator demo",
        "Video upload demo",
        "Phone protection demo",
        "Robux simulator"
      ],
      "description": "The frontend includes multiple feature pages that are primarily client-side/simulated: AI Song Generator, Videos (local state + object URLs), Movies (sample listings), Radio (simulated play/stop), Live TV (channel selection), Phone Protection (simulated scan), Robux Simulator (fake code generation + clipboard), plus Help/Announcements/Roadmap/Games/Groups placeholder pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Stripe checkout session support (backend)",
      "synonyms": [
        "Stripe outcalls",
        "createCheckoutSession"
      ],
      "description": "Backend includes HTTP outcall utilities and a Stripe integration module to configure Stripe keys (admin-only), create checkout sessions, and query session status with principal extraction from client_reference_id.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Caffeine blob-storage maintenance endpoints (backend)",
      "synonyms": [
        "Storage gateway authorization",
        "blob GC/pruning"
      ],
      "description": "Backend mixin exposes endpoints for updating authorized gateway principals, listing/pruning dead blobs, checking blob liveness, and refilling the storage cashier canister with cycles (cashier-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-advanced-search-engine-page-frontend-src-pages-searchenginepage-tsx-to-include-a-new-feature-surfaced-to-users-as-web-search-ultra-and-clearly-labeled-coming-soon-representing-a-future-capability-to-search-the-public-web-news-for-current-information",
      "title": "Update the Advanced Search Engine page (`frontend/src/pages/SearchEnginePage.tsx`) to include a new feature surfaced to users as **“Web Search Ultra”** and clearly labeled **“Coming Soon”**, representing a future capability to search the public web/news for current information.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement full Groups feature (create/join/manage groups; groups are “out now” so users can start creating)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement backend Groups domain model and persistent in-canister state for groups, including: group metadata (name, description, visibility), owner/creator principal, member list, creation/update timestamps, and an ID scheme that guarantees uniqueness.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add backend canister methods required for an MVP Groups launch so users can start creating: create a group, list groups, fetch a group by ID, join a group, leave a group, and update/delete a group (restricted to the group owner). Enforce authentication/authorization using the existing access-control permission checks (authenticated users only).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Extend the frontend React Query layer (`frontend/src/hooks/useQueries.ts`) with group query/mutation hooks that call the new backend group canister methods (create, list, get by ID, join, leave, update, delete), with appropriate cache keys and invalidations so the Groups UI stays in sync after mutations.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Replace the placeholder UI in `frontend/src/pages/GroupsPage.tsx` with a working Groups experience that lets authenticated users: view a list of groups, create a new group via a form (dialog or inline), and join/leave groups from the list. Ensure all user-facing text is in English and provide clear loading/empty/error states.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add a branded, app-specific login page/screen (while still using Internet Identity for authentication) instead of relying only on the current authenticated app shell flow.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement friend connection requests (send/accept/decline) and gate 1:1 chat so users can only chat after a connection request is accepted; add a dedicated “Chat with Friends” page reflecting this state.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Restrict editing of the latest announcements so regular users cannot edit; only admins can modify announcements content.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Enhance Math Search voice assistant behavior: after speaking an answer, automatically speak a follow-up phrase (default: “Would you like to ask another question?”) and ensure voice output stops safely on errors/bugs with a user-visible error message.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Add spelling correction to Search (mark as “Coming soon” in UI until implemented) alongside voice search and improved math solver experience.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Implement a persistent Groups domain model in `backend/main.mo` including: unique group ID, name, description, visibility (public/private), owner/creator Principal, member list, and created/updated timestamps.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Add backend canister methods for an MVP Groups launch in `backend/main.mo`: createGroup, listGroups, getGroupById, joinGroup, leaveGroup, updateGroup, deleteGroup, with authentication required for all methods and owner-only authorization for update/delete.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "Extend `frontend/src/hooks/useQueries.ts` with React Query hooks for Groups that call the new backend methods (create, list, get-by-id, join, leave, update, delete) and ensure correct cache keys and invalidations so the Groups UI stays in sync after mutations.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Replace the placeholder UI in `frontend/src/pages/GroupsPage.tsx` with a functional MVP Groups experience for authenticated users: view a list of groups, create a group via a form (dialog or inline), and join/leave groups from the list; include clear English loading/empty/error states.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "Add a “Web Search Ultra” feature (marked as Coming Soon) that searches the public web/news so users can query for current information beyond in-app content.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "Rename/rebrand app to “JAMESPaudio Social App” (including updated logo/branding across the UI).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "Implement real content search across in-app domains (apps/music/videos/movies/etc.) to replace stubbed empty results and make “all search features available.”",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-18",
      "summary": "Add a global “Unavailable / Something went wrong” page/route and use it for missing accounts and unexpected app errors (safe fallback UX).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "Enhance Daily Rewards to grant a randomized points amount per day (within defined bounds) and persist/track claims as part of the rewards system.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "Add Live TV module/page (beyond the current simulated/demo experience) with a concrete set of channels/streams and working playback.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-21",
      "summary": "Create/expand Help pages into a real FAQ/guides experience, including a dedicated section titled “Need Help with Math?” tied to Math Search usage.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-22",
      "summary": "Add a fire-themed loading/intro screen with heavy beats audio, plus user settings to disable or reduce volume (if not already covered by existing settings).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architecturalNotes": [
    "Frontend is React + TypeScript using shadcn/ui components, TailwindCSS (OKLCH-based theme variables), lucide-react icons, and Sonner for toast notifications.",
    "Data fetching/mutations use @tanstack/react-query with a custom useActor hook to construct an authenticated canister actor (or anonymous actor) and invalidate/refetch queries when identity changes.",
    "Authentication uses Internet Identity via @dfinity/auth-client wrapped in a React context provider (InternetIdentityProvider) with persisted sessions and explicit login/logout controls.",
    "The app shell (MainApp) uses local state for page selection with a responsive sidebar + mobile Sheet menu; some pages also use TanStack Router navigation helpers, resulting in mixed navigation patterns.",
    "Backend is a Motoko canister (backend/main.mo) using mo:core Map/List-based in-memory state, with mixins for authorization (role assignment) and blob-storage maintenance operations.",
    "Authorization is role-based (admin/user/guest). First initializer with a correct secret becomes admin; roles are stored in an AccessControl map and enforced by backend methods.",
    "Backend supports IC HTTP outcalls with response transforms, and includes a Stripe module to create checkout sessions and query session status (configuration gated by admin).",
    "Blob storage integration includes authorization of gateway principals and garbage-collection/pruning hooks using low-level Prim APIs.",
    "Several “platform modules” in the UI are intentionally simulated client-side (AI song generation, video uploads, live TV/radio playback simulation, phone protection scan) without backend persistence.",
    "SearchEngine math solving now uses a dedicated safeMathEvaluator utility instead of relying on eval() directly.",
    "Repository now includes a reusable build-template (React + shadcn/ui + ICP canister scaffolding) with scripts for image pruning/resizing and standardized frontend/backend canister YAML/config."
  ],
  "knownIssues": [
    "Frontend hook useFollowUser/useUnfollowUser throws “not yet implemented”; follow/unfollow buttons exist but cannot succeed.",
    "Messaging is not implemented: useGetMessagesWithUser returns [] and useSendMessage throws “not yet implemented”, though Chat UI polls and renders messages.",
    "Home feed and friend suggestions are stubbed: useGetHomeFeed/useGetFriendSuggestions return empty arrays; FeedPage UI exists but cannot show real feed/suggestions.",
    "Published apps are not implemented server-side: useGetAllPublishedApps returns [] and usePublishApp throws; PublishedAppsPage enforces 70-point requirement in UI but cannot actually publish.",
    "Live streams backend integration is stubbed in hooks: useGetLiveStreams returns [], create/stop mutations throw; LiveStreamsPage UI exists but cannot persist streams.",
    "SearchEngine “content search” (apps/music/videos/movies) is stubbed: useSearchContent always returns empty results; only the client-side math solver produces results.",
    "EditProfileDialog tracks a local “status” field but never sends it; backend updateProfile only updates bio/profilePicture, so status editing is effectively non-functional.",
    "MainApp imports TanStack Router constructs but does not use them for page rendering; navigation is mostly local state while some pages use useNavigate, which can lead to inconsistent routing behavior.",
    "There are two different frontend index.css files shown with overlapping CSS variable definitions, which may indicate duplication/conflicts depending on build setup."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "JAMESPaudio Social App",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}