{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "JAMESPaudio is a decentralized “creative social hub” built on the Internet Computer. It has a React/TypeScript frontend (Tailwind + shadcn/ui) and a Motoko canister backend. Authentication uses Internet Identity; the backend applies role-based access control (admin/user/guest) initialized via a secret token. Implemented backend-backed features include user profiles, public profile discovery/search, presence (last-online) tracking, points wallet + transaction history, points store (browse/redeem) and demo points purchase, daily rewards and a daily “mystery box” (Daily Items Secret), premium membership/free-trial state, music uploads via IC blob storage (ExternalBlob) and friends’ music discovery, search engine provider preferences and per-user search history, and groups with member-only group messaging plus an in-chat UI flow to add new members. Several additional modules exist as frontend-only simulated/placeholder experiences (e.g., AI song generator, live TV, radio, videos/movies, creator studio, roadmaps/help pages).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II login",
        "AuthClient"
      ],
      "description": "Provides login/logout and persisted delegation identity using @dfinity/auth-client via InternetIdentityProvider/useInternetIdentity, exposing detailed login status flags (initializing/logging-in/success/error).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-aware backend actor creation and query invalidation",
      "synonyms": [
        "useActor",
        "authenticated actor"
      ],
      "description": "Creates an anonymous canister actor for guests and an authenticated actor when an Internet Identity is present. On actor changes, invalidates and refetches non-actor react-query caches to ensure identity-scoped data is refreshed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control (RBAC) with admin bootstrap token",
      "synonyms": [
        "AccessControl",
        "admin/user/guest roles"
      ],
      "description": "Motoko RBAC assigns roles per Principal and enforces authorization checks on protected methods. Initialization uses CAFFEINE_ADMIN_TOKEN and a user-provided secret to assign the first eligible caller as admin; includes APIs to query role and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "App bootstrap with loading screen and profile setup gating",
      "synonyms": [
        "LoadingScreen",
        "ProfileSetupModal"
      ],
      "description": "Shows a branded animated loading screen on launch, routes unauthenticated users to LoginPage, and blocks authenticated users without a profile with a mandatory profile-creation modal before allowing app access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile creation and retrieval",
      "synonyms": [
        "createProfile",
        "getCallerUserProfile",
        "getProfile"
      ],
      "description": "Backend supports creating a profile (username + bio) and retrieving profiles publicly (getProfile) and for the authenticated caller (getCallerUserProfile). Frontend uses react-query hooks to fetch and display profile data across pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profile editing (bio + profile picture passthrough)",
      "synonyms": [
        "updateProfile",
        "EditProfileDialog"
      ],
      "description": "Allows authenticated users to update their profile bio and profile picture metadata via backend updateProfile; frontend provides an edit dialog with loading state and toasts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Public user search by username",
      "synonyms": [
        "SearchPage",
        "searchProfiles"
      ],
      "description": "Provides a user search page that queries backend searchProfiles for username matches and renders results as UserCards with profile info and relationship actions (follow/unfollow currently stubbed).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Presence/last-online tracking",
      "synonyms": [
        "updateLastOnline",
        "getLastOnline"
      ],
      "description": "Backend stores per-user lastOnline timestamps; frontend periodically updates the caller’s last-online and displays relative status for users in ProfilePage and chat list items.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Recent statuses feed (public discovery)",
      "synonyms": [
        "What's Recent",
        "getRecentStatuses"
      ],
      "description": "Backend exposes getRecentStatuses(limit) for a recency-sorted list of user status/last-online entries; FeedPage renders this as the “What’s Recent” section.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Points wallet and transaction history",
      "synonyms": [
        "PointsPage",
        "getPointsHistory"
      ],
      "description": "Backend tracks points and records points transactions (earn/spend/purchase). Frontend PointsPage displays current balance (from profile), computed stats, and a sorted transaction history with type-specific icons and timestamps.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Daily rewards (claim once per day) with streak tracking",
      "synonyms": [
        "claimDailyReward",
        "daily login streak"
      ],
      "description": "Backend claimDailyReward awards points and updates streak/claim counts; frontend DailyRewardsPage provides claim UI with animations, eligibility messaging, and streak/balance stats.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Points store browsing and redemption",
      "synonyms": [
        "getStoreItems",
        "purchaseStoreItem"
      ],
      "description": "Backend exposes a public store catalog and authenticated redemption that deducts points and records a transaction. Frontend PointsStorePage lists items, disables purchase when insufficient points, and shows success/error toasts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Demo points purchasing (Stripe integration scaffolded)",
      "synonyms": [
        "purchasePoints",
        "buy points"
      ],
      "description": "Backend purchasePoints increments points and records a purchase transaction (not real payment). Frontend PointsStorePage provides a demo purchase UI with quick-select amounts and balance preview; backend also includes Stripe checkout/session-status scaffolding for future real payments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Daily Items Secret (daily mystery box)",
      "synonyms": [
        "claimDailyItemsSecret",
        "mystery reward"
      ],
      "description": "Backend supports claiming a daily randomized MysteryItem reward, checking claim availability, and retrieving the last claimed item. Frontend DailyItemsSecretPage adds claim gating, an opening animation, and revealed/last-claimed reward display with item-type styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Music uploads via IC blob storage and friends’ music discovery",
      "synonyms": [
        "uploadMusic",
        "ExternalBlob",
        "getFriendsMusicUploads"
      ],
      "description": "Users can upload music files to the canister using ExternalBlob; uploads are stored on the user profile and can be browsed by the uploader. The app also fetches and displays music uploaded by followed users (“Friends’ Music”) with playback controls using direct blob URLs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Premium membership and free trial lifecycle",
      "synonyms": [
        "upgradeToPremium",
        "activateFreeTrial"
      ],
      "description": "Backend supports premium upgrades with expirations and a one-time 3-day free trial. Frontend MembersOnlyPage shows membership/trial state and provides actions to activate a trial and upgrade for selected durations (premium content listing is currently stubbed).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Search Engine Store (provider catalog + default selection)",
      "synonyms": [
        "getAvailableSearchEngines",
        "setDefaultSearchEngine"
      ],
      "description": "Backend exposes a catalog of search engines and per-user default selection; frontend SearchEngineStorePage lets authenticated users set their default engine and visually highlights the current default, with guest browsing allowed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Per-user search history recording and viewing",
      "synonyms": [
        "recordSearchHistory",
        "getSearchHistory"
      ],
      "description": "Backend records per-user search history (bounded to the most recent entries) and exposes it for authenticated users. Frontend SearchEnginePage records history on search when authenticated, and SearchEngineStorePage displays recent history.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Advanced search UI (tabs, voice input, safe math evaluation, AI voice output)",
      "synonyms": [
        "SearchEnginePage",
        "SpeechRecognition",
        "speechSynthesis",
        "safeMathEvaluator"
      ],
      "description": "Frontend implements a multi-tab advanced search experience. It supports voice-to-text search input (when browser-supported), safe on-device math solving with step breakdown, and spoken responses controlled by Settings via useVoiceSettings. Non-math content search tabs are currently “coming soon”, and a web-search tab uses mock results.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Groups: create/list groups and member-only group messaging",
      "synonyms": [
        "createGroup",
        "getUserGroups",
        "GroupConversation"
      ],
      "description": "Backend supports creating groups, listing a user’s groups, fetching group details, and member-only group messaging with optional media attachments. Frontend GroupsPage provides group creation, selection, and a conversation view with polling, auto-scroll, emoji insertion, and attachment previews.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Add people to a group from the group chat UI",
      "synonyms": [
        "AddGroupMembersDialog",
        "addGroupMember"
      ],
      "description": "GroupConversation includes an “Add People” action that opens a dialog to search users by username and add a selected user to the currently selected group via backend addGroupMember. The dialog filters out existing members and shows confirmation messaging without navigating away from the conversation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Settings persisted in localStorage (background music + AI voice assistant)",
      "synonyms": [
        "SettingsPage",
        "useVoiceSettings"
      ],
      "description": "Frontend SettingsPage stores background music enabled/volume and AI voice assistant enabled/muted/volume preferences in localStorage and notifies same-tab/cross-tab listeners so SearchEnginePage speech behavior updates immediately.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Responsive authenticated app shell with header, theme toggle, and navigation",
      "synonyms": [
        "MainApp",
        "Header",
        "dark mode"
      ],
      "description": "MainApp provides responsive navigation (desktop sidebar + mobile sheet) across many modules. Header shows branding, a points badge shortcut, theme toggle via next-themes, and a user avatar dropdown with logout that clears react-query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Static/simulated content modules (frontend-only experiences)",
      "synonyms": [
        "demo pages",
        "placeholders"
      ],
      "description": "Includes multiple non-backend or simulated modules: AI Song Generator (simulated generation), Videos (local object-URL upload), Movies (sample listings), Radio (simulated play/stop), Live TV (simulated channels), Phone Protection (simulated scan), Robux Simulator (fake code generator), Creator Studio (placeholder dashboard), Help/What’s New/Roadmap/Games Coming Soon informational pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Blob-storage maintenance endpoints (Caffeine storage mixin)",
      "synonyms": [
        "_caffeineStorage*",
        "blob GC/pruning"
      ],
      "description": "Backend exposes maintenance endpoints to update authorized gateway principals, query dead blobs to delete, confirm deletions (triggering GC), check blob liveness, create upload certificates, and refill a cashier canister with cycles (cashier-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "HTTP outcalls helper and Stripe checkout scaffolding",
      "synonyms": [
        "IC http_request",
        "Stripe sessions"
      ],
      "description": "Backend includes HTTP GET/POST helpers using ic:aaaaa-aa http_request with a transform that strips headers, plus Stripe helper functions to configure keys (admin-only), create checkout sessions, and query session status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-wire-up-direct-messaging-in-the-react-frontend-by-implementing-usegetmessageswithuser-and-usesendmessage-in-frontend-src-hooks-usequeries-ts-to-call-the-new-backend-dm-apis-and-update-the-chat-ui-so-sending-a-message-immediately-adds-it-to-the-conversation-view-optimistic-update-or-immediate-refetch-and-polling-refetching-shows-new-messages-without-a-full-page-reload",
      "title": "Wire up direct messaging in the React frontend by implementing `useGetMessagesWithUser` and `useSendMessage` in `frontend/src/hooks/useQueries.ts` to call the new backend DM APIs, and update the chat UI so sending a message immediately adds it to the conversation view (optimistic update or immediate refetch) and polling/refetching shows new messages without a full page reload.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-chats-page-sidebar-data-source-to-use-the-backend-inbox-chat-list-for-direct-messages-most-recent-dm-partners-instead-of-relying-only-on-followers-following-lists-while-keeping-the-existing-search-filter-ui-working",
      "title": "Update the Chats page sidebar data source to use the backend ‘inbox’/chat list for direct messages (most recent DM partners) instead of relying only on followers/following lists, while keeping the existing search filter UI working.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add instant messaging (real-time direct messages / chat delivery)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement backend-supported 1:1 direct messaging so authenticated users can send a message to another user and retrieve the full conversation history with that user. Add Motoko canister methods for (a) sending a direct message and (b) querying direct messages between the caller and a specified other user, returning messages in chronological order and enforcing that only the two participants can access the conversation.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a backend API to support an ‘inbox’/chat list for direct messages: provide a method that returns the list of unique conversation partners for the caller (Principals) ordered by most recent message activity, so the frontend Chats page can show real DM threads even if follow/unfollow is not implemented.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend uses React + TypeScript with TailwindCSS and shadcn/ui components; lucide-react supplies icons and sonner provides toast notifications.",
    "Data fetching/mutations are centralized in @tanstack/react-query hooks (frontend/src/hooks/useQueries.ts), with cache invalidation on mutation success and on actor/identity changes.",
    "Backend communication is mediated by an identity-aware canister actor created by useActor; an anonymous actor is used for guests, and an authenticated actor is created when an Internet Identity is present.",
    "Backend authorization is a Motoko RBAC layer (authorization/access-control.mo) composed into the canister via a mixin (authorization/MixinAuthorization.mo). First-time initialization can assign the first valid caller as admin based on an env token and a user-provided secret.",
    "Main in-app navigation inside MainApp is implemented via local component state (page switching) with a responsive desktop sidebar and a mobile Sheet menu; some pages also use TanStack Router navigation APIs for path-based navigation (mixed navigation model).",
    "Backend composes additional capabilities via mixins (blob-storage maintenance endpoints) and includes HTTP outcall helpers and Stripe checkout/session-status scaffolding.",
    "Voice features (SearchEnginePage) rely on browser SpeechRecognition (voice-to-text) and speechSynthesis (text-to-speech). AI voice settings are persisted in localStorage and synchronized via a custom hook (useVoiceSettings).",
    "Math solving in the advanced search UI uses a custom safe tokenizer + recursive-descent parser (safeMathEvaluator) rather than eval()."
  ],
  "known_issues": [
    "Follow/unfollow is not implemented: useFollowUser/useUnfollowUser throw \"not yet implemented\", so follow buttons in Search/User cards and friend suggestions cannot succeed.",
    "1:1 messaging is not implemented: useGetMessagesWithUser returns [] and useSendMessage throws \"Messaging functionality not yet implemented\"; Chats UI is effectively non-functional beyond layout.",
    "Home feed and friend suggestions are stubbed: useGetHomeFeed/useGetFriendSuggestions return empty arrays; only the “What’s Recent” section works (getRecentStatuses).",
    "Content search is stubbed: useSearchContent returns empty results for non-math tabs; only math solving and the mock “Web Search Ultra” tab produce output.",
    "Web Search Ultra is mock-only (useWebSearchUltra returns placeholder results) and does not call a real external search API.",
    "Published apps and live streams are not implemented end-to-end: list queries return [] and publish/create/stop mutations throw \"not yet implemented\".",
    "Premium content listing is stubbed: useGetPremiumContent returns [] so MembersOnlyPage shows no real premium content items.",
    "Backend bug: updatePointsBalance overwrites points for positive amounts (sets points to amount) instead of adding; this can corrupt balances when awarding points-based rewards (e.g., Daily Items Secret).",
    "Backend bug: Daily Items Secret cooldown check can be incorrect because canClaimDailySecret reads dailyItemsRewardHistory by key userId.toText(), but claims are stored in the map under claimId (caller_time).",
    "Backend env var appears misspelled: blob storage expects CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (triple “F”); deployments using a different spelling will trap.",
    "Auth bootstrap is brittle: _initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set, potentially breaking authenticated actor creation in environments missing that variable.",
    "Mixed navigation model: MainApp uses internal state, while several pages use TanStack Router navigation (e.g., /points, /search-engine-store). Without consistent routing integration, some navigation calls may not behave as expected.",
    "ScrollArea refs are used for imperative scrolling (ChatWindow/GroupConversation); depending on ScrollArea ref-forwarding behavior, auto-scroll may be unreliable.",
    "Branding inconsistencies remain (e.g., frontend/index.html title and ProfileSetupModal still reference “Chat With Us”).",
    "Duplicate/competing Tailwind token files exist (frontend/index.css vs frontend/src/index.css), which can cause theme/token confusion depending on build wiring.",
    "Backend state is kept in in-memory Maps/Lists without stable persistence shown; data may be lost on canister upgrades/redeploys."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "JAMESPaudio",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}